NAME = ircserv

CXX = c++
CXXFLAGS = -Wall -Wextra -Werror -std=c++98

SRC = Src/Server.cpp Src/Client.cpp  Src/Channel.cpp Src/main.cpp Src/CommandHandler.cpp Src/Bot.cpp



OBJ = $(addprefix obj/, $(SRC:.cpp=.o))

RESET  = \033[0m
BOLD   = \033[1m
CYAN   = \033[36m
GREEN  = \033[32m

all: $(NAME)



$(NAME): $(OBJ)
	@$(CXX) $(CXXFLAGS) $(OBJ) -o $(NAME)
	@clear
	@echo "$(CYAN)$(BOLD)"
	@echo "  ██╗██████╗  ██████╗███████╗███████╗██████╗ ██╗   ██╗"
	@echo "  ██║██╔══██╗██╔════╝██╔════╝██╔════╝██╔══██╗██║   ██║"
	@echo "  ██║██████╔╝██║     ███████╗█████╗  ██████╔╝██║   ██║"
	@echo "  ██║██╔══██╗██║     ╚════██║██╔══╝  ██╔══██╗╚██╗ ██╔╝"
	@echo "  ██║██║  ██║╚██████╗███████║███████╗██║  ██║ ╚████╔╝ "
	@echo "  ╚═╝╚═╝  ╚═╝ ╚═════╝╚══════╝╚══════╝╚═╝  ╚═╝  ╚═══╝ "
	@echo "$(RESET)"
	@echo "$(GREEN)$(BOLD)  ✓ Build $(NAME) ready!$(RESET)"
	@echo " "

obj/%.o: %.cpp
	@mkdir -p $(dir $@)
	@$(CXX) $(CXXFLAGS) -c $< -o $@

clean:
	@rm -rf obj

fclean: clean
	@rm -f $(NAME)

re: fclean all

.PHONY: all clean fclean re